vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.LPC55S28_DFP.pdsc
    <condition id="driver.camera-device-ap1302.condition_id">
      <require condition="allOf.driver.camera-device-common, driver.video-i2c, device=LPC55S28.internal_condition"/>
    </condition>
    <condition id="allOf.driver.camera-device-common, driver.video-i2c, device=LPC55S28.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="video-i2c"/>
      <require condition="device.LPC55S28.internal_condition"/>
    </condition>
    <condition id="driver.camera-device-common.condition_id">
      <require condition="allOf.driver.camera-common, device=LPC55S28.internal_condition"/>
    </condition>
    <condition id="allOf.driver.camera-common, device=LPC55S28.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="camera-common"/>
      <require condition="device.LPC55S28.internal_condition"/>
    </condition>
    <condition id="driver.camera-device-max9286.condition_id">
      <require condition="allOf.driver.camera-device-common, driver.video-i2c, device=LPC55S28.internal_condition"/>
    </condition>
    <condition id="driver.camera-device-mt9m114.condition_id">
      <require condition="allOf.driver.camera-device-common, driver.video-i2c, device=LPC55S28.internal_condition"/>
    </condition>
    <condition id="driver.camera-device-ov5640.condition_id">
      <require condition="allOf.driver.camera-device-common, driver.camera-device-sccb, device=LPC55S28.internal_condition"/>
    </condition>
    <condition id="allOf.driver.camera-device-common, driver.camera-device-sccb, device=LPC55S28.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-sccb"/>
      <require condition="device.LPC55S28.internal_condition"/>
    </condition>
    <condition id="driver.camera-device-ov7670.condition_id">
      <require condition="allOf.driver.camera-device-common, driver.camera-device-sccb, device=LPC55S28.internal_condition"/>
    </condition>
    <condition id="driver.camera-device-ov7725.condition_id">
      <require condition="allOf.driver.camera-device-common, driver.camera-device-sccb, device=LPC55S28.internal_condition"/>
    </condition>
    <condition id="driver.camera-device-sccb.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, device=LPC55S28.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.flexcomm_i2c, driver.common, device=LPC55S28.internal_condition">
      <require condition="anyOf.driver.flexcomm_i2c.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.LPC55S28.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.flexcomm_i2c.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
    </condition>
    <condition id="driver.camera-receiver-common.condition_id">
      <require condition="allOf.driver.camera-common, device=LPC55S28.internal_condition"/>
    </condition>
    <condition id="driver.casper.condition_id">
      <require condition="allOf.driver.common, device_id=LPC55S28.internal_condition"/>
    </condition>
    <condition id="driver.clock.condition_id">
      <require condition="allOf.driver.power, device=LPC55S28.internal_condition"/>
    </condition>
    <condition id="allOf.driver.power, device=LPC55S28.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="power"/>
      <require condition="device.LPC55S28.internal_condition"/>
    </condition>
    <condition id="driver.cmp_1.condition_id">
      <require condition="allOf.driver.common, device_id=LPC55S28.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_flexcomm_i2c.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.I2C, device.RTE, driver.flexcomm_i2c_dma, device=LPC55S28.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.I2C, device.RTE, driver.flexcomm_i2c_dma, device=LPC55S28.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.4.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_dma"/>
      <require condition="device.LPC55S28.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_flexcomm_spi.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.SPI, device.RTE, driver.flexcomm_spi_dma, device=LPC55S28.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.SPI, device.RTE, driver.flexcomm_spi_dma, device=LPC55S28.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.3.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi_dma"/>
      <require condition="device.LPC55S28.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_flexcomm_usart.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.USART, device.RTE, driver.flexcomm_usart_dma, device_id=LPC55S28.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.USART, device.RTE, driver.flexcomm_usart_dma, device_id=LPC55S28.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.4.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart_dma"/>
      <require condition="device_id.LPC55S28.internal_condition"/>
    </condition>
    <condition id="driver.codec.condition_id">
      <require condition="allOf.device=LPC55S28.internal_condition"/>
    </condition>
    <condition id="driver.common.condition_id">
      <require condition="allOf.device=LPC55S28.internal_condition"/>
    </condition>
    <condition id="allOf.cores=cm33.condition_id">
      <require condition="cores.cm33.internal_condition"/>
    </condition>
